#include <iostream>

int max_(int arr[], int size) {
	if (size == 0) { return arr[size]; }
	return std::max(arr[size], max_(arr, size - 1));
}

int min_(int arr[], int size) {
	if (size == 1) { return arr[size]; }
	return std::min(arr[size - 1], min_(arr, size - 1));
}

int main()
{

	/*
	*   Приклад візуалізації: 1
		Початковий масив:34, 7, 23, 32, 5
		Опорний елемент: 5
		Масив після поділу:5 34 7 23 32
		Індекс опорного елемента: 0
		Ліва частина:
		Права частина: 34 7 23 32
		Опорний елемент:32
		Масив після поділу: 7 23 32 34
		Індекс опорного елемента: 3
		Ліва частина: 7 23
		Права частина: 34
		Опорний елемент: 23
		Масив після поділу: 7 23
		Індекс опорного елемента: 2
		Відсортований масив:5 7 23 32 34

		Приклад візуалізації: 2
		Початковий масив:  1, 2, 3, 4, 5, 6
		Опорний елемент: 6
		Масив після поділу: 1 2 3 4 5 6
		Індекс опорного елемента: 6
		Ліва частина: 1 2 3 4 5
		Права частина:
		Опорний елемент: 5
		Масив після поділу: 1 2 3 4 5
		Індекс опорного елемента: 5
		Ліва частина: 1 2 3 4
		Права частина:
		Опорний елемент: 4
		Масив після поділу: 1 2 3 4
		Індекс опорного елемента: 4
		Ліва частина: 1 2 3
		Права частина:
		Опорний елемент: 3
		Масив після поділу: 1 2 3
		Індекс опорного елемента: 3
		Ліва частина: 1 2
		Права частина:
		Опорний елемент: 2
		Масив після поділу: 1 2
		Індекс опорного елемента: 2
		Ліва частина: 1
		Права частина:
		Відсортований масив: 1 2 3 4 5 6


		Приклад візуалізації: 3
		Початковий масив: 90, 80, 70, 60, 50, 40, 30
		Опорний елемент: 90
		Масив після поділу: 80 70 60 50 40 30 90
		Індекс опорного елемента: 7
		Ліва частина: 80 70 60 50 40 30
		Права частина:
		Опорний елемент: 80
		Масив після поділу:70 60 50 40 30 80
		Індекс опорного елемента: 6
		Ліва частина: 70 60 50 40 30
		Права частина:
		Опорний елемент: 70
		Масив після поділу: 60 50 40 30 70
		Індекс опорного елемента: 5
		Ліва частина: 60 50 40 30
		Права частина:
		Опорний елемент: 60
		Масив після поділу: 50 40 30 60
		Індекс опорного елемента: 4
		Ліва частина: 50 40 30
		Права частина:
		Опорний елемент: 50
		Масив після поділу: 40 30 50
		Індекс опорного елемента: 3
		Ліва частина: 40 30
		Права частина:
		Опорний елемент: 40
		Масив після поділу: 30 40
		Індекс опорного елемента: 2
		Ліва частина: 30
		Права частина:
		Відсортований масив: 30 40 50 60 70 80 90


		Приклад візуалізації: 4
		Початковий масив: 5, 3, 8, 8, 1, 5, 3, 9
		Опорний елемент: 9
		Масив після поділу: 5 3 8 8 1 5 3 9
		Індекс опорного елемента: 8
		Ліва частина: 5 3 8 8 1 5 3
		Права частина:
		Опорний елемент: 3
		Масив після поділу: 1 3 3 5 8 8 5
		Індекс опорного елемента: 2
		Ліва частина: 1
		Права частина: 3 5 8 8 5
		Опорний елемент: 5
		Масив після поділу: 3 5 5 8 8
		Індекс опорного елемента: 2
		Ліва частина: 3
		Права частина: 5 8 8
		Опорний елемент: 8
		Масив після поділу: 5 8 8
		Індекс опорного елемента: 3
		Ліва частина: 5 8
		Права частина:
		Опорний елемент: 8
		Масив після поділу: 5 8
		Індекс опорного елемента: 2
		Ліва частина: 5
		Права частина:
		Відсортований масив: 1 3 3 5 5 8 8 9
	*/
}
